package levelOne.warpdemo.practice;

public class WarpDemo_0 {
    public static void main(String[] args) {
        /**
         *  基本類型       包裝類
         *  byte          Byte
         *  short         Short
         *  int           Integer
         *  long          Long
         *  float         Float
         *  double        Double
         *  boolean       Boolean
         *  chat          Character
         */

        /**============================
         *  基本類型  => 引用類型(包裝類)
         ============================*/
        //基本使用

        //推薦使用...，可以緩衝一個字節的內容，實現復用

        //String類型 -> Integer類型(內容必須純數字)

        //最大值、最小值

        //double沒有緩存機制，本質就是創建新對象

        //String類型 -> Double類型(內容必須純數字)

        /**=============================================
         *  包裝類 -> 基本類型   包裝類.基本類型valueOf()
         =============================================*/
        //int、double、交互




        /**=============================================
         *  Integer實現進制轉換
         =============================================*/
        int data = 10;
        //轉換為二進制

        //轉換為八進制

        //轉換為16進制


        /**=============================================
         *  自動拆裝箱
         =============================================*/
        int e = 123;

        //編譯器支持自動裝箱
        
        //編譯器支持自動拆箱


    }
}
